src/artillery/new-people.yml
config:
  target: "http://localhost:3100"
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      authentication: "Bearer 123"
  payload:
    path: "./people.csv"
    fields:
      - "name"
scenarios:
  - name: "Crear persona y obtener detalle"
    flow:
      - post:
          url: "/people"
          json:
            name: "{{name}}"
          capture:
            json: "$.id"
            as: "id"
      - get:
          url: "/people/{{ id }}"